optimagyf/RFIDscanner/nodeMCULolinV3_ESP8266/src/main.cpp
// /**************************************************************************
//  This is an example for our Monochrome OLEDs based on SSD1306 drivers

//  Pick one up today in the adafruit shop!
//  ------> http://www.adafruit.com/category/63_98

//  This example is for a 128x64 pixel display using I2C to communicate
//  3 pins are required to interface (two I2C and one reset).

//  Adafruit invests time and resources providing this open
//  source code, please support Adafruit and open-source
//  hardware by purchasing products from Adafruit!

//  Written by Limor Fried/Ladyada for Adafruit Industries,
//  with contributions from the open source community.
//  BSD license, check license.txt for more information
//  All text above, and the splash screen below must be
//  included in any redistribution.
//  **************************************************************************/

// #include <Wire.h>
// #include <Adafruit_GFX.h>
// #include <Adafruit_SSD1306.h>
// #include <Adafruit_I2CDevice.h>

// #define SCREEN_WIDTH 128 // OLED display width, in pixels
// #define SCREEN_HEIGHT 64 // OLED display height, in pixels

// // Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
// // The pins for I2C are defined by the Wire-library.
// // On an arduino UNO:       A4(SDA), A5(SCL)
// // On an arduino MEGA 2560: 20(SDA), 21(SCL)
// // On an arduino LEONARDO:   2(SDA),  3(SCL), ...
// #define SCREEN_ADDRESS 0x3C ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
// #define OLED_RESET -1       // Reset pin # (or -1 if sharing Arduino reset pin)
// Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

// #define NUMFLAKES 10 // Number of snowflakes in the animation example

// #define LOGO_HEIGHT 16
// #define LOGO_WIDTH 16
// static const unsigned char PROGMEM logo_bmp[] =
//     {B00000000, B11000000,
//      B00000001, B11000000,
//      B00000001, B11000000,
//      B00000011, B11100000,
//      B11110011, B11100000,
//      B11111110, B11111000,
//      B01111110, B11111111,
//      B00110011, B10011111,
//      B00011111, B11111100,
//      B00001101, B01110000,
//      B00011011, B10100000,
//      B00111111, B11100000,
//      B00111111, B11110000,
//      B01111100, B11110000,
//      B01110000, B01110000,
//      B00000000, B00110000};

// void testdrawline()
// {
//   int16_t i;

//   display.clearDisplay(); // Clear display buffer

//   for (i = 0; i < display.width(); i += 4)
//   {
//     display.drawLine(0, 0, i, display.height() - 1, SSD1306_WHITE);
//     display.display(); // Update screen with each newly-drawn line
//     delay(1);
//   }
//   for (i = 0; i < display.height(); i += 4)
//   {
//     display.drawLine(0, 0, display.width() - 1, i, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }
//   delay(250);

//   display.clearDisplay();

//   for (i = 0; i < display.width(); i += 4)
//   {
//     display.drawLine(0, display.height() - 1, i, 0, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }
//   for (i = display.height() - 1; i >= 0; i -= 4)
//   {
//     display.drawLine(0, display.height() - 1, display.width() - 1, i, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }
//   delay(250);

//   display.clearDisplay();

//   for (i = display.width() - 1; i >= 0; i -= 4)
//   {
//     display.drawLine(display.width() - 1, display.height() - 1, i, 0, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }
//   for (i = display.height() - 1; i >= 0; i -= 4)
//   {
//     display.drawLine(display.width() - 1, display.height() - 1, 0, i, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }
//   delay(250);

//   display.clearDisplay();

//   for (i = 0; i < display.height(); i += 4)
//   {
//     display.drawLine(display.width() - 1, 0, 0, i, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }
//   for (i = 0; i < display.width(); i += 4)
//   {
//     display.drawLine(display.width() - 1, 0, i, display.height() - 1, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }

//   delay(2000); // Pause for 2 seconds
// }

// void testdrawrect(void)
// {
//   display.clearDisplay();

//   for (int16_t i = 0; i < display.height() / 2; i += 2)
//   {
//     display.drawRect(i, i, display.width() - 2 * i, display.height() - 2 * i, SSD1306_WHITE);
//     display.display(); // Update screen with each newly-drawn rectangle
//     delay(1);
//   }

//   delay(2000);
// }

// void testfillrect(void)
// {
//   display.clearDisplay();

//   for (int16_t i = 0; i < display.height() / 2; i += 3)
//   {
//     // The INVERSE color is used so rectangles alternate white/black
//     display.fillRect(i, i, display.width() - i * 2, display.height() - i * 2, SSD1306_INVERSE);
//     display.display(); // Update screen with each newly-drawn rectangle
//     delay(1);
//   }

//   delay(2000);
// }

// void testdrawcircle(void)
// {
//   display.clearDisplay();

//   for (int16_t i = 0; i < max(display.width(), display.height()) / 2; i += 2)
//   {
//     display.drawCircle(display.width() / 2, display.height() / 2, i, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }

//   delay(2000);
// }

// void testfillcircle(void)
// {
//   display.clearDisplay();

//   for (int16_t i = max(display.width(), display.height()) / 2; i > 0; i -= 3)
//   {
//     // The INVERSE color is used so circles alternate white/black
//     display.fillCircle(display.width() / 2, display.height() / 2, i, SSD1306_INVERSE);
//     display.display(); // Update screen with each newly-drawn circle
//     delay(1);
//   }

//   delay(2000);
// }

// void testdrawroundrect(void)
// {
//   display.clearDisplay();

//   for (int16_t i = 0; i < display.height() / 2 - 2; i += 2)
//   {
//     display.drawRoundRect(i, i, display.width() - 2 * i, display.height() - 2 * i,
//                           display.height() / 4, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }

