optimagyf/RFIDscanner/nodeMCULolinV3_ESP8266/src/main.cpp
void ICACHE_RAM_ATTR handleInterrupt1()
{
  printf("In handleInterrupt1\n");
  hasInterruption1 = true;
}

Adafruit_SSD1306 *display = NULL;

TwoWire *wire = NULL;
// Set pins for I2C communication
// wire.begin(SDA_PIN, SCL_PIN);

void setup()
{
  // put your setup code here, to run once:
  // initialize the LED digital pin as an output.
  pinMode(PIN_LED, OUTPUT);
  pinMode(INTERRUPTION0_PIN, INPUT_PULLUP);

  // TwoWire wire;
  // // Set pins for I2C communication
  // wire.begin(SDA_PIN, SCL_PIN);
  // Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &wire, OLED_RESET);
  wire = new TwoWire();
  wire->begin(SDA_PIN, SCL_PIN);
  display = new Adafruit_SSD1306(SCREEN_WIDTH, SCREEN_HEIGHT, wire, OLED_RESET);

  Serial.begin(115200);
  while (!Serial)
    ;

  delay(200);

  Serial.println("");
  Serial.println("");
  Serial.println(" *** ");
  Serial.println("Begin setup");
  Serial.println(" *** ");

  // *** Initialisation of the screen
  if (!display->begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS))
  {
    Serial.println(F("SSD1306 allocation failed"));
    for (;;)
      ;
  }

  // Show initial display buffer contents on the screen --
  // the library initializes this with an Adafruit splash screen.
  display->display();

  // *** Initialisation of RFID reader
  // Init SPI bus
  SPI.begin();
  // Init MFRC522
  mfrc522.PCD_Init();
  // Optional delay. Some board do need more time after init to be ready, see Readme
  delay(4);
  // Show details of PCD - MFRC522 Card Reader details
  mfrc522.PCD_DumpVersionToSerial();
  // Serial.println(F("Scan PICC to see UID, SAK, type, and data blocks..."));

  // *** Initialisation of wifi connexion
  setupWifi();

  // *** Setup interaction button
  attachInterrupt(digitalPinToInterrupt(INTERRUPTION0_PIN), handleInterrupt0, FALLING);
  attachInterrupt(digitalPinToInterrupt(INTERRUPTION1_PIN), handleInterrupt1, FALLING);

  // Clean the screen display
  display->clearDisplay();
  display->display();

  Serial.println(" *** ");
  Serial.println("End setup");
  Serial.println(" *** ");
}

String getUID(MFRC522::Uid *uid)
{
  String res = "";

  for (byte i = 0; i < uid->size; i++)
  {
    res += String(uid->uidByte[i], HEX);
  }
  return res;
}

const String SERVER_IP("192.168.8.100:3000");

void doGetnSendUID()
{
  WiFiClient client;
  HTTPClient http;

  Serial.print("[HTTP] begin...\n");
  // configure traged server and url
  String serverEndPoint = "http://" + SERVER_IP + "/postplain/";
  Serial.print("[HTTP] serverEndPoint: " + serverEndPoint + "\n");
  http.setReuse(true);
  http.begin(client, serverEndPoint);
  http.addHeader("Content-Type", "application/json");

  // start connection and send HTTP header and body
  String message = "{\"uid\":" + getUID(&(mfrc522.uid)) + "}";
  Serial.print("[HTTP] message: " + message + "\n");
  int httpCode = http.POST(message);
  String payload = http.getString();
  Serial.print("[HTTP] payload: " + payload + "\n");

  // httpCode will be negative on error
  if (httpCode > 0)
  {
    // HTTP header has been send and Server response header has been handled
    Serial.printf("[HTTP] POST succeeded\n");
  }
  else
  {
    Serial.printf("[POST FAILED] httpCode: %d\n", httpCode);
    Serial.printf("[POST FAILED] error: %s\n", http.errorToString(httpCode).c_str());
  }

  http.end();
}

void getnSendUID()
{
  static ulong checkgetuid_timeout = 0;

  static ulong currentMillis;

#define GETUID_INTERVAL 1000L

  currentMillis = millis();

  // Reset the loop if no new card present on the sensor/reader.
  // This saves the entire process when idle.
  if (!mfrc522.PICC_IsNewCardPresent())
  {
    return;
  }

  // Select one of the cards
  if (!mfrc522.PICC_ReadCardSerial())
  {
    return;
  }

  // Check RFID every GETUID_INTERVAL (1) seconds.
  if ((currentMillis > checkgetuid_timeout) || (checkgetuid_timeout == 0))
  {
    doGetnSendUID();
    checkgetuid_timeout = currentMillis + GETUID_INTERVAL;
  }
}

// void displayInterruption0()
// {
//   static ulong displayTimeout = 0;

//   static ulong currentMillis;

//   static const ulong displayDuration = 3000;

//   currentMillis = millis();

//   if (hasInterruption0)
//   {
//     displayTimeout = millis();
//     hasInterruption0 = false;
//   }

//   static bool hasPrintMessage = false;
//   static bool isClean = false;

//   if ((displayTimeout <= currentMillis) && (currentMillis < displayTimeout + displayDuration))
//   {
//     if (!hasPrintMessage)
//     {
//       display->clearDisplay();

//       display->setTextSize(2);              // Draw 2X-scale
//       display->setTextColor(SSD1306_WHITE); // Draw white text
//       display->setCursor(0, 0);             // Start at top-left corner
//       display->println(F("Interrupt 0"));
//       display->display();
//       isClean = false;
//       hasPrintMessage = true;
//     }
//   }
//   else
//   {
//     if (!isClean)
//     {
//       display->clearDisplay();
//       display->display();
//       isClean = true;
//       hasPrintMessage = false;
//     }
//   }
// }

// void displayInterruption1()
// {
//   static ulong displayTimeout = 0;

//   static ulong currentMillis;

//   static const ulong displayDuration = 3000;

//   currentMillis = millis();

//   if (hasInterruption1)
//   {
//     displayTimeout = millis();
//     hasInterruption1 = false;
//   }

//   static bool hasPrintMessage = false;
//   static bool isClean = false;

//   if ((displayTimeout <= currentMillis) && (currentMillis < displayTimeout + displayDuration))
//   {
//     if (!hasPrintMessage)
//     {
//       display->clearDisplay();

//       display->setTextSize(2);              // Draw 2X-scale
//       display->setTextColor(SSD1306_WHITE); // Draw white text
//       display->setCursor(0, 0);             // Start at top-left corner
//       display->println(F("Interrupt 1"));
//       display->display();
//       isClean = false;
//       hasPrintMessage = true;
//     }
//   }
//   else
//   {
//     if (!isClean)
//     {
//       display->clearDisplay();
//       display->display();
//       isClean = true;
//       hasPrintMessage = false;
//     }
//   }
// }

ulong displayTimeout = 0;
ulong currentMillis;
ulong displayDuration = 3000;
String messageToPrint;

bool hasPrintMessage = false;
bool isClean = false;

void displayMessage()
{
  currentMillis = millis();

  // if (hasInterruption1)
  // {
  //   displayTimeout = millis();
  //   hasInterruption1 = false;
  // }

  if ((displayTimeout <= currentMillis) && (currentMillis < displayTimeout + displayDuration))
  {
    if (!hasPrintMessage)
    {
      display->clearDisplay();

      display->setTextSize(2);              // Draw 2X-scale
      display->setTextColor(SSD1306_WHITE); // Draw white text
      display->setCursor(0, 0);             // Start at top-left corner
      // display->println(F("Interrupt 1"));
      display->println(messageToPrint.c_str());

      display->display();
      isClean = false;
      hasPrintMessage = true;
    }
  }
  else
  {
    if (!isClean)
    {
      display->clearDisplay();
      display->display();
      isClean = true;
      hasPrintMessage = false;
    }
  }
}

void loop()
{
  if (hasInterruption0)
  {
    hasInterruption0 = false;

    displayTimeout = millis();
    displayDuration = 3000;
    messageToPrint = "Interru. 0";
    hasPrintMessage = false;
    // requestPortalConfiguration();
  }

  if (hasInterruption1)
  {
    hasInterruption1 = false;

    displayTimeout = millis();
    displayDuration = 1000;
    messageToPrint = "Interru. 1\n  AGAIN";
    hasPrintMessage = false;
  }

  displayMessage();

  // put your main code here, to run repeatedly
  checkWifiStatus();

  if (WiFi.status() == WL_CONNECTED)
  {
    getnSendUID();
  }
}